# Part 1: ERD using flat file

![png](Images/books.png)

# Part 2: Create the database in Python

In [1]:
import json
with open('/Users/patelmedzy/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [2]:

#IMPORTS
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists
import pymysql
from urllib.parse import quote_plus as urlquote
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
#connection = "dialect+driver://username:password@host:port/database"
#connection_str = "mysql+pymysql://root:root@localhost/books"
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/books"
engine = create_engine(connection)

In [3]:
engine = create_engine(connection)

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

In [5]:
q = '''
SHOW TABLES'''
pd.read_sql(q,engine)

Empty DataFrame
Columns: [Tables_in_books]
Index: []

In [6]:
authors = pd.read_csv('Data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [7]:
authors.to_sql('authors', engine, index=False, if_exists = 'replace')

5

In [8]:
books = pd.read_csv('Data/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
books.to_sql('books', engine, index=False, if_exists = 'replace')

6

In [11]:
favorites = pd.read_csv('Data/favorites.csv')
favorites.to_sql('favorites', engine, index=False, if_exists = 'replace')

7

In [12]:
users = pd.read_csv('Data/users.csv')
users.to_sql('users', engine, index=False, if_exists = 'replace')

3

In [14]:
q='''
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
'''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1